Repository: oscarahalvorsen/masterproject
Catalog: datacollecting/MAALFRID/tmx/kompetansenorge.no.csv-en-nb.deduped.tmx
Source language: en
Languages: nb

source: • apply knowledge about the Norwegian health services to gain access to
nb: • bruke kunnskap om det norske helsevesenet til å få tilgang til ulike

source: authentic texts, such as signs, notices, noticeboards, websites, tables and advertisements;
nb: tekster, for eksempel skilt, oppslag, informasjonstavler, nettsider, tabeller og reklamer

source: • give examples of important laws, rules and values regarding the rights of
nb: • gi eksempler på viktige lover, regler og verdier som omhandler barn og

source: Digital skills Using digital skills in Norwegian language training for adult immigrants means using digital resources to interact, find relevant information, create oral and written texts and develop and express one's own competence in a Norwegian-language context.
nb: Digitale ferdigheter Å bruke digitale ferdigheter i faget norsk for voksne innvandrere innebærer å bruke digitale ressurser til å samhandle, finne relevant informasjon, skape muntlige og skriftlige tekster og utvikle og uttrykke egen kompetanse i en norskspråklig sammenheng.

source: • read tables for handling of loads
nb: • Miljø og forurensning

source: The mapping of participants should also clarify their short and long-term goals for learning Norwegian, their work experience, their digital skills and their health and life circumstances, including sight and hearing.
nb: Kartleggingen bør også få fram deltakernes mål med å lære norsk på kort og lang sikt, deres arbeidserfaring, deres digitale ferdigheter og deres helse- og livssituasjon, deriblant syn og hørsel.

source: The term motivation is frequently used in school/learning contexts to explain pupil behaviour, and particularly its direction and intensity, perseverance and experience of mastery (Skaalvik & Skaalvik, 2003).
nb: Begrepet motivasjon brukes ofte i skole-/læringssammenheng for å forklare elevenes atferd, og særlig dens retning, intensitet, utholdenhet og opplevelse av mestring (Skaalvik & Skaalvik, 2003).

source: • employ strategies to compensate for vocabulary deficits, for example by
nb: • bruke strategier for å kompensere for mangler i ordforrådet, for eksempel

source: • interpret and describe diagrams and other visual information clearly and
nb: • kan tolke og beskrive diagrammer og annen visuell informasjon på en klar og

source: At level B2, participants can understand complex language and can express themselves objectively, clearly and in a nuanced way on a wide range of general topics and topics within their occupation and areas of interest.
nb: På nivå B2 kan deltakeren forstå komplekst språk og uttrykke seg saklig, klart og nyansert om et vidt spekter av allmenne emner og emner innenfor eget fagfelt og egne interesseområder.

source: • employ different interaction strategies, such as interjecting in a discussion
nb: • bruke ulike samhandlingsstrategier, for eksempel å gripe inn i en diskusjon

source: The training must be adapted to each participant, and it is only when there are circumstances that prevent adaptation that the Norwegian goal can be reduced.
nb: Opplæringen skal tilpasses den enkelte, og det er først når det foreligger forhold som det ikke kan tilpasses for, at norskmålet kan settes ned.

source: In this chapter, we discuss how the use of digital aids such as blogs, forums, wiki and other co-writing tools can support the development of the participants’ written as well as oral communication skills.
nb: I dette kapitlet diskuterer vi hvordan bruk av digitale hjelpemidler som blogg, fora, wiki og andre (samskri-vings)verktøy kan støtte opp under utvikling av deltakernes skriftlige, men også muntlige kommunikasjons-ferdigheter.

source: points of view and attitudes in a detailed and nuanced way;
nb: oppbygning og gi uttrykk for synspunkter og holdninger på en utfyllende og nyansert måte.

source: Regularly the warehouse worker will:
nb: • Kan både på papir og digitalt søke etter

source: that would motivate the participants, irrespective of their
nb: Begrunnelsen er at deltakelsen i opplæring fal er med alder.

source: • read traffic signs and instructions
nb: • V, annonser og bruksanvisninger som er klart formulert

source: In recent years, motivation studies have focused on pupils’ self-image and their impression of the language, subject and teacher, and the dynamics between them (cf. Dörnyei & Ushioda, 2009, and in a Norwegian language learning context, Carrai 2014).
nb: I de siste årene har motivasonsstudier vært opptatt av elevenes selvbilde og elevenes bilde av språket, faget og læreren og dynamikken som oppstår mellom disseaspektene (jf. Dörnyei & Ushioda, 2009, og i en norsk språkopplæringskontekst Carrai 2014).

source: • discuss different traditions and views of religion in Norwegian society and
nb: • samtale om ulike tradisjoner og syn på religion i det norske samfunnet og

source: by using body language or words from other languages they speak.
nb: eksempel ved hjelp av kroppsspråk eller ord fra andre språk som deltakeren kan

source: • understand very simple notifications, messages, instructions and directions
nb: • forstå helt enkle meldinger, beskjeder, instruksjoner og stedsanvisninger når

source: Prostitution and trafficking
nb: Prostitusjon og menneskehandel/trafficking

source: Smoking indoors is against the law, except in private homes.
nb: Det er forbudt å røyke innendørs, med unntak av i private hjem.

source: • Women who have undergone genital mutilation
nb: • Kvinner som er kjønnslemlestet, kan få store

source: • discuss gender equality and women's participation in working life, education
nb: • samtale om likestilling og kvinners deltakelse i arbeidslivet, utdanning og

source: • discuss negative social control, violence in close relationships, forced
nb: • samtale om hva negativ sosial kontroll, vold i nære relasjoner,

source: • understand the main content and some details in short, simple notifications,
nb: • forstå hovedinnholdet og enkelte detaljer i korte, enkle meldinger,

source: regarded as sexual harassment and sexual assault, including rape.
nb: trakassering og seksuelle overgrep, herunder voldtekt.

source: The reception element covers receiving, processing and understanding text and oral communication.
nb: Resepsjon Kjerneelementet resepsjon handler om det å motta, bearbeide og forstå tekst og muntlig kommunikasjon.

source: • discuss the importance of critical thinking and ethical awareness, including
nb: • samtale om betydningen av kritisk tenkning og etisk bevissthet, blant annet

source: Linguistic interaction occurs, inter alia, in conversations, email correspondence and chats, and may involve different linguistic acts, like information exchange and discussion.
nb: Språklig samhandling skjer blant annet i samtaler, e-postutveksling og chat, og kan involvere ulike språkhandlinger som for eksempel informasjonsutveksling og diskusjon.

source: • understand the subject matter in short, simple conversations;
nb: • oppfatte temaet i korte, enkle samtaler

source: • According to Norwegian law, what Hans did to Marit was rape.
nb: • Etter norsk lov er det Hans gjør med Marit, en voldtekt.

source: They must be able to compare Norwegian with other languages they know, use knowledge about language as a system and apply cultural understanding to how language is used in different contexts.
nb: De skal kunne sammenligne norsk med andre språk de kan, bruke kunnskaper om språket som system og anvende en kulturell forståelse for hvordan språk brukes i ulike sammenhenger.

source: This includes having Norwegian language skills which allow them to stay up to date on health-related issues, to communicate their thoughts, feelings, experiences and needs, and to express their own identity.
nb: Dette innebærer blant annet å ha norskferdigheter til å holde seg informert om helserelaterte temaer, til å kommunisere rundt tanker, følelser, erfaringer og behov og til å uttrykke egen identitet.

source: Patrick and Maria have been married for 10 years and have two children, aged 6 and 9.
nb: Patrick og Maria har vært gift i 10 år og har to barn på 6 og 9 år.

source: • describe people, places and objects in very simple terms;
nb: • beskrive personer, steder og gjenstander på en svært enkel måte

source: • express and explain in brief terms opinions on simple coherent texts;
nb: • uttrykke og kort begrunne meninger i enkle sammenhengende tekster

source: The Act is intended to help immigrants acquire good Norwegian language skills, knowledge of Norwegian society, formal qualifications and a permanent attachment to working life.
nb: Loven skal bidra til at innvandrere får gode norskkunnskaper, kunnskap om norsk samfunnsliv, formelle kvalifikasjoner og en varig tilknytning til arbeidslivet.

source: The right and obligation to Norwegian language training is regulated in the Integration Act and in the Regulations to the Integration Act (the Integration Regulations).
nb: Rett og plikt til opplæring i norsk er regulert i integreringsloven og i forskrift til integreringsloven (integreringsforskriften).

source: • read excerpts from laws and regulations
nb: • Kan lese og forstå utvalgt skjønnlitteratur

source: • answer simple questions about themselves in an interview situation;
nb: • svare på enkle spørsmål om seg selv i en intervjusituasjon

source: The study by Lee & Ranta (2014) shows, interestingly, that many use English although they have a different native language – English clearly acts as a l
nb: Studien til Lee & Ranta (2014) viser interessant nok at mange bruker engelsk til tross for at de har et annet morsmål – engelsk fungerer åpenbart som et

source: • write down the main points from a meeting or a professional presentation on
nb: • notere hovedpunkter fra et møte eller en faglig presentasjon om et kjent

source: Unlike blogs and forums, wiki is primarily intended to serve as a co-writing and co-publication tool.
nb: Wiki er, til forskjell fra blogg og forum, primært tenkt som et verktøy for samskriving og sampublisering.

source: The internet makes it possible to be in several places at once, and a person who wants to move to Norway can use – given that they have the digital skills and physical access to the internet – Facebook, WhatsApp etc. to get in touch with people who have already settled in Norway and who can help them get to know the country and the language.
nb: Internett gjør det mulig å være til stede flere steder samtidig, og en person som ønsker å flytte til Norge kan bruke – forutsatt at hun/han har tilstrekkelige digitale ferdigheter og fysisk tilgang til nett – Facebook, WhatsApp eller liknende til å komme i kontakt med folk som allerede har etablert seg i Norge og som kan være til hjelp når det gjelder å bli kjent med landet og språket.

source: The use of realistic, authentic tasks is appropriate in online environments where interac-tion plays an important role, e.g. in social media, and a task-based approach to language learning that is either fully or partially online is thus natural (cf. González-Lloret & Ortega, 2014).
nb: Bruk av realistiske, autentiske oppgaver er godt egnet i nettbaserte omgivelser hvor samhandling spiller en viktig rolle, for eksempel i sosiale medier, og det faller derfor naturlig å ha en oppgavebasert tilnærming til språklæring som foregår helt eller delvis på nett (jf. González-Lloret & Ortega, 2014).

source: • present an issue or problem and justify their own view by developing and
nb: • presentere en sak eller en problemstilling og begrunne eget

source: Participants must develop the reading and listening strategies they need to understand spoken and written Norwegian in different situations, including strategies for handling dialects and the forms of Norwegian they encounter in everyday life.
nb: Deltakerne skal utvikle lese- og lyttestrategiene de trenger for å forstå muntlig og skriftlig norsk i ulike sammenhenger, blant annet strategier for å håndtere dialekter og målformer de møter i dagliglivet.

source: • write texts within their occupation and areas of interest where they critically
nb: • skrive faglige tekster innenfor eget fag- og interessefelt der en

source: • collaborate on tasks by inviting others to participate, providing input, asking
nb: • samarbeide om oppgaver ved å invitere andre til å delta, bidra med innspill,

source: through sexual contact, for example:
nb: som smitter gjennom seksuelt samvær, for

source: • write in simple terms about themselves, such as where they live, what they
nb: • skrive svært enkelt om seg selv og nære forhold, slik som hvor en bor, hva

source: The characteristics of the language use describe the vocabulary, pronunciation, grammar, flow, text structure, spelling/punctuation and communication of a language user at level C1.
nb: Kjennetegn ved språket i bruk beskriver hva som karakteriserer vokabular, uttale, grammatikk, flyt, tekstutforming, ortografi/tegnsetting og kommunikasjon hos en språkbruker på nivå C1.

source: C1 users will have greater linguistic success within their occupation and area of interest than in disciplines and areas of interest that are unfamiliar or new to them.
nb: En C1-bruker vil klare seg bedre språklig innenfor eget fagområde og interessefelt enn innenfor fagområder og interessefelt som er ukjente eller nye.

source: Language learning strategies The language learning strategies element covers the use of varied strategies to learn and practise language in different contexts and in a lifelong perspective.
nb: Kjerneelementet språklæringsstrategier handler om å bruke varierte strategier for å lære og prøve ut språk i ulike sammenhenger og i et livslangt perspektiv.

source: • use numbers and expressions for time, quantities and prices in everyday
nb: • bruke tall og uttrykk for tid, mengder og priser i dagligdagse

source: • write and read familiar words and simple sentences with support, for
nb: • skrive og lese kjente ord og enkle setninger med støtte, for eksempel ved

source: • read and understand very simple fiction texts;
nb: • lese og forstå svært enkle skjønnlitterære tekster

source: • read and understand very simple, adapted informative and fiction texts,
nb: • lese og forstå svært enkle, tilrettelagte informative og skjønnlitterære

source: • Rape does not necessarily involve intercourse.
nb: • Voldtekt behøver ikke å involvere samleie.

source: The topic also covers the Norwegian language skills that participants need to manage their lives in Norway through participation in training and education, in working life, in cultural and leisure activities, in contact with public services and in different social communities.
nb: Temaet folkehelse og livsmestring handler også om hvilke norskferdigheter deltakerne trenger for å ivareta sin egen livssituasjon i Norge, gjennom deltakelse i opplæring og utdanning, i arbeidslivet, i kultur- og fritidsaktiviteter, i kontakt med offentlige tjenester og i ulike sosiale fellesskap.

source: Participants can take part in simple, familiar interactions if their conversation partners adapt their language and are willing to be supportive.
nb: Deltakeren kan delta i enkle, kjente samhandlingssituasjoner dersom samhandlingspartnerne tilpasser språket og er innstilt på å hjelpe.

source: About the subject The curriculum for Norwegian language training for adult immigrants forms part of a regulation to the Act relating to Integration through Training, Education and Work (the Integration Act) and will be used for training of participants with a right and/or obligation to Norwegian language training pursuant to this Act.
nb: Om faget Fagets relevans og sentrale verdier Læreplan i norsk for voksne innvandrere er en forskrift til lov om integrering gjennom opplæring, utdanning og arbeid (integreringsloven) og skal brukes i opplæring for deltakere med rett og plikt eller plikt til norskopplæring etter denne loven.

source: Learners can provide clear and detailed descriptions and presentations of complex topics, where they draw on aspects of the topics and relevant examples, elaborate on opinions and provide support for them, and appropriately bring the matter to a close.
nb: Innlæreren kan gi klare, detaljerte beskrivelser og presentasjoner av komplekse emner, der hun/han trekker inn delmomenter og relevante eksempler, utdyper og underbygger synspunkter og runder av på en passende måte.

source: • read and understand complex instructions and user manuals relating to their
nb: • lese og forstå komplekse instruksjoner og bruksanvisninger knyttet til eget

source: • employ simple reading strategies, such as deriving the meaning of specific,
nb: • bruke noen enkle lesestrategier, som å utlede betydningen av konkrete,

source: • recognise familiar symbols and words in very simple, authentic texts in
nb: • gjenkjenne noen kjente symboler og ord i svært enkle, autentiske tekster i

source: Scope The competence goals are divided into three modules, each of which have a scope of 25 hours.
nb: Kompetansemålene er delt inn i tre moduler, som hver har et timeomfang på 25 timer.

source: What consequences could Andreas’ behaviour have for his wife and for Andreas himself?
nb: Hvilke konsekvenser kan atferden til Andreas få for både kona og Andreas selv?

source: • understand important information on familiar topics from short auditory and
nb: • oppfatte viktig informasjon om kjente emner fra korte auditive og

source: • recognise icons and make relevant choices in apps and vending machines
nb: • gjenkjenne ikoner og gjøre relevante valg i apper, på automater og på enkle

source: • Enticing someone into travel ing out of Norway and entering into a forced
nb: • Å lokke noen til å reise ut av landet med mål om å

source: • read and understand very simple sentences in short, simple notifications and
nb: • lese og forstå svært enkle setninger i korte, enkle meldinger og beskjeder

source: Concrete and systematic feedback to participants during the training, which identifies the areas they have mastered and those they need more practice in, will both increase their awareness and motivate them.
nb: Konkrete og systematiske tilbakemeldinger til deltakerne underveis i opplæringen, der det går fram både hva deltakerne mestrer, og hva de bør øve mer på, virker bevisstgjørende og motiverende.

source: Director for the Department of Administration
nb: – Denne opplæringen er en viktig milepæl for oss.

source: The interdisciplinary topics are intended to allow topics from social studies to be incorporated into Norwegian language training, where they are studied from a linguistic perspective.
nb: Hvilke temaer og språkhandlinger man skal fokusere på, må tilpasses deltakernes norskferdigheter, deres livssituasjon og hva de har behov for å bruke det norske språket til i hverdagen.

source: The descriptions of the different language levels in the framework are therefore inextricably linked to the contexts or areas of interest in which the language is used, and which are described in the framework through the concept of domains.
nb: Beskrivelsene av de ulike språknivåene i rammeverket er derfor uløselig knyttet til sammenhengene eller interesseområdene språket brukes i, og som i rammeverket er beskrevet gjennom begrepet domener.

source: do for a living, and their likes and dislikes;
nb: en gjør, og hva en liker og ikke liker

source: (MOOCs) has increased in recent years, includ-ing language MOOCs.
nb: (MOOCs) økt, og det gjelder også for språk-MOOCs.

source: • Contraception is a means of preventing pregnancy.
nb: • Prevensjonsmidler skal hindre graviditet.

source: The objective of the training is for participants to be able to use simple phrases and sentences to talk about familiar topics related to themselves and their learning and work situations.
nb: Mål for opplæringen er at deltakeren skal kunne bruke enkle fraser og setninger for å snakke om kjente emner knyttet til eget liv, opplæring og arbeid.

source: • take useful notes from a meeting, presentation or lecture in their own
nb: • ta hensiktsmessige notater fra et møte, en presentasjon eller forelesning

source: girl who alternates between several different languages and cultures when she is on Facebook and when she writes a text together with two multilingual classmates.
nb: Vi ser det også hos Bahar, en afghansk jente som beveger seg mellom en rekke ulike språk og kulturer når hun er på Facebook og når hun skriver en tekst i lag med to flerspråklige klassekamerater.

source: This is similar to the procedure followed in work on the European Language Portfolio (Skills Norway, 2016).
nb: Dette ligner på det som gjøres i arbeidet med Språkpermen (Kompetanse Norge, 2016).

source: An article written by Xiao (2014) provides an interesting insight into the motivation of a Chinese participant in an online English course.
nb: En artikkel skrevet av Xiao (2014) gir et interessant innblikk i motivasjonen til en kinesisk deltaker i et nettba-sert engelskkurs.

source: • Can this advice help Niwar’s parents?
nb: • Kan disse rådene hjelpe foreldrene til Niwar?

source: • present themselves and their competence, and answer questions in an
nb: • presentere seg selv og egen kompetanse og svare på spørsmål i forbindelse

source: • hold well-structured, prepared presentations, both with and without the use
nb: • holde velstrukturerte, forberedte presentasjoner, både med og uten bruk av

source: Regularly the long-distance transport worker will
nb: Antallet har deretter avtatt gradvis.

source: • develop an argument in a text, giving reasons for or against a specific point
nb: • skrive tekster der en utvikler et argument, gir grunner for eller imot et

source: • express their own needs, opinions and feelings in everyday interactions in
nb: • gi enkelt uttrykk for egne behov, meninger og følelser i dagligdagse

source: • put forward their own arguments in discussions and meetings within their
nb: • argumentere for egne synspunkter i diskusjoner og møter innen eget fag- og

source: -Do you have any thoughts about what aspects of mathematics are the same and different between the cultures?
nb: -Har du tanker om hva som er likt og hva som er forskjellig mellom kulturer når det gjelder matematikk?

source: • discuss family planning, contraception and abortion, understanding and
nb: • samtale om familieplanlegging, prevensjonsmidler og abort, forståelse og

source: • Rape is where one person forces sexual activity upon another person.
nb: • Voldtekt innebærer at en person påtvinger en annen person seksuell

source: • The victim and the perpetrator are
nb: • Offeret og gjerningspersonen er ofte

source: Participants must develop Norwegian language skills and strategies that allow them to interact in relevant situations and media in everyday life.
nb: Deltakerne skal utvikle norskferdigheter og strategier som gjør dem i stand til å samhandle i relevante situasjoner og medier i dagliglivet.

source: At level A1, participants can understand and use familiar, everyday expressions and very simple phrases about themselves and topics they are familiar with.
nb: På nivå A1 kan deltakeren forstå og bruke kjente, dagligdagse uttrykk og svært enkle utsagn om seg selv og det kjente og nære.

source: Paula Winke (2014) provides an example of a program that facilitates the use of video clips,
nb: Paula Winke (2014) gir et eksempel på et program som legger til rette for bruk av videoopptak,

source: The objective of the training is for participants to gain a basic understanding of letters and numbers, and to learn skills and strategies that aid writing for learning purposes and in everyday life.
nb: Mål for opplæringen er at deltakeren skal få en grunnleggende forståelse av skrift og tall og noen ferdigheter og strategier for å kunne nærme seg å bruke skrift i egen opplæring og dagligliv.
